<?php
    return [
        // 判断数据包中时间戳 与 服务器时间 差值大于此值时则表明请求无效
        'timestamp' => 120,
        'count' => 10, // 手机验证码次数
        // 响应状态码与说明
        'code' => [
            0 => [
                'code' => 0,
                'message' => '请求成功',
            ],
            // 公共
            1001 => [
                'code' => 1001,
                'message' => '参数缺失或参数不合法',
            ],
            1002 => [
                'code' => 1002,
                'message' => '签名错误',
            ],
            1003 => [
                'code' => 1003,
                'message' => '服务器异常',
            ],
            1004 => [
                'code' => 1004,
                'message' => '未授权访问',
            ],
            1005 => [
                'code' => 1005,
                'message' => '您没有该权限',
            ],
            1006 => [
                'code' => 1006,
                'message' => '手机验证码错误',
            ],
            // 登录注册模块
            2001 => [
                'code' => 2001,
                'message' => '密码错误',
            ],
            2002 => [
                'code' => 2002,
                'message' => '邮箱已存在',
            ],
            2003 => [
                'code' => 2003,
                'message' => '手机号已存在',
            ],
            2004 => [
                'code' => 2004,
                'message' => '该手机号不是您注册时的手机号',
            ],
            2005 => [
                'code' => 2005,
                'message' => '原密码错误',
            ],
            2006 => [
                'code' => 2006,
                'message' => '用户不存在',
            ],
            2007 => [
                'code' => 2007,
                'message' => '您的账号已被禁用',
            ],
            2008 => [
                'code' => 2008,
                'message' => '您已被永久封号',
            ],
            2009 => [
                'code' => 2009,
                'message' => '您已被封号',
            ],
            2010 => [
                'code' => 2010,
                'message' => '密码长度为6-20位',
            ],
            2011 => [
                'code' => 2011,
                'message' => '请勿重复注册',
            ],
            // 个人中心
            3001 => [
                'code' => 3001,
                'message' => '图片格式不正确',
            ],
            3002 => [
                'code' => 3002,
                'message' => '无效的图片',
            ],
            3003 => [
                'code' => 3003,
                'message' => '原支付密码错误',
            ],
            3004 => [
                'code' => 3004,
                'message' => '只有主账号才能申请实名认证',
            ],
            3005 => [
                'code' => 3005,
                'message' => '实名认证信息不存在',
            ],
            3006 => [
                'code' => 3006,
                'message' => '子账号不能查看主账号实名认证信息',
            ],
            3007 => [
                'code' => 3007,
                'message' => '操作过于频繁',
            ],
            // 资金流水 您的账号余额不够
            4001 => [
                'code' => 4001,
                'message' => '您的账号余额不够',
            ],
            4002 => [
                'code' => 4002,
                'message' => '支付密码错误',
            ],
            4003 => [
                'code' => 4003,
                'message' => '用户不合法',
            ],
            4004 => [
                'code' => 4004,
                'message' => '金额不合法',
            ],
            4005 => [
                'code' => 4005,
                'message' => '金额不合法',
            ],
            4006 => [
                'code' => 4006,
                'message' => '资金子类型不存在',
            ],
            4007 => [
                'code' => 4007,
                'message' => '资金子类型错误',
            ],
            4008 => [
                'code' => 4008,
                'message' => '冻结余额不够',
            ],
            4009 => [
                'code' => 4009,
                'message' => '不存在相关的冻结记录',
            ],
            4010 => [
                'code' => 4010,
                'message' => '解冻金额大于冻结金额',
            ],
            // 公告帮助消息中心
            5001 => [
                'code' => 5001,
                'message' => '该条公告不存在',
            ],
            5002 => [
                'code' => 5002,
                'message' => '该条帮助不存在',
            ],
            5003 => [
                'code' => 5003,
                'message' => '该条留言不存在',
            ],
            // 订单
            7001 => [
                'code' => 7001,
                'message' => '管理员ID不存在',
            ],
            7002 => [
                'code' => 7002,
                'message' => '用户ID不存在',
            ],
            7003 => [
                'code' => 7003,
                'message' => '接单密码错误',
            ],
            7004 => [
                'code' => 7004,
                'message' => '您不可以接自己发的单',
            ],
            7005 => [
                'code' => 7005,
                'message' => '订单当前状态异常',
            ],
            7006 => [
                'code' => 7006,
                'message' => '您无权操作该订单',
            ],
            7007 => [
                'code' => 7007,
                'message' => '暂时没有验收图片',
            ],
            7008 => [
                'code' => 7008,
                'message' => '暂时没有仲裁信息',
            ],
            8001 => [
                'code' => 8001,
                'message' => '图片不存在',
            ]
        ],

    ];
