<?php
return [
    // 判断数据包中时间戳 与 服务器时间 差值大于此值时则表明请求无效
    'timestamp' => 120,

    // 响应状态码与说明
    'code' => [
        1000 => [
            'code' => 1000,
            'message' => '请求成功',
        ],
        1001 => [
            'code' => 1001,
            'message' => '没有找到相关数据',
        ],
        1002 => [
            'code' => 1002,
            'message' => '服务器错误',
        ],

        // 订单模块
        2001 => [
            'code' => 2001,
            'message' => '订单号不存在',
        ],

    ],

];
