<?php
return [
    // 判断数据包中时间戳 与 服务器时间 差值大于此值时则表明请求无效
    'timestamp' => 120,

    // 响应状态码与说明
    'code' => [
        0 => [
            'code' => 0,
            'message' => '请求成功',
        ],
        // 公共
        1001 => [
            'code' => 1001,
            'message' => '参数缺失',
        ],
        1002 => [
            'code' => 1002,
            'message' => '签名错误',
        ],
        1003 => [
            'code' => 1003,
            'message' => '服务器异常',
        ],
        // 登录注册模块
        2001 => [
            'code' => 2001,
            'message' => '密码错误',
        ],
        2002 => [
            'code' => 2002,
            'message' => '邮箱已存在',
        ],
        // 个人中心

    ],

];
