<?php
    return [
        // 判断数据包中时间戳 与 服务器时间 差值大于此值时则表明请求无效
        'timestamp' => 120,

        // 响应状态码与说明
        'code' => [
            0 => [
                'code' => 0,
                'message' => '请求成功',
            ],
            // 公共
            1001 => [
                'code' => 1001,
                'message' => '参数缺失',
            ],
            1002 => [
                'code' => 1002,
                'message' => '签名错误',
            ],
            1003 => [
                'code' => 1003,
                'message' => '服务器异常',
            ],
            1004 => [
                'code' => 1004,
                'message' => '未授权',
            ],
            // 登录注册模块
            2001 => [
                'code' => 2001,
                'message' => '密码错误',
            ],
            2002 => [
                'code' => 2002,
                'message' => '邮箱已存在',
            ],
            2003 => [
                'code' => 2003,
                'message' => '手机号已存在',
            ],
            2004 => [
                'code' => 2004,
                'message' => '请填写注册时候的手机号',
            ],
            2005 => [
                'code' => 2005,
                'message' => '原密码错误',
            ],
            // 个人中心
            3001 => [
                'code' => 3001,
                'message' => '上传图片类型不合法',
            ],
            3002 => [
                'code' => 3002,
                'message' => '上传图片为空',
            ],
            3003 => [
                'code' => 3003,
                'message' => '原支付密码错误',
            ],
            3004 => [
                'code' => 3004,
                'message' => '只有主账号才能填写实名认证',
            ],
        ],

    ];
