<?php
return [
    'type' => [
        1 => '充值',
        2 => '提现',
        3 => '冻结',
        4 => '解冻',
        5 => '收入',
        6 => '支出',
    ],
    'sub_type' => [
        // 充值
        11 => '微信充值',
        12 => '支付宝充值',

        // 提现
        21 => '提现到微信',
        22 => '提现到支付宝',

        // 冻结
        31 => '冻结代练费',
        32 => '冻结效率金',
        33 => '冻结安全金',
        34 => '冻结认证金',
        35 => '冻结提现金',

        // 解冻
        41 => '解冻代练费',
        42 => '解冻效率金',
        43 => '解冻安全金',
        44 => '解冻认证金',
        45 => '解冻提现金',

        // 收入
        51 => '收入代练费',
        52 => '收入效率金',
        53 => '收入安全金',
        54 => '收入奖励金',

        // 支出
        61 => '支出代练费',
        62 => '支出效率金',
        63 => '支出安全金',
        64 => '支出手续费',
        65 => '支出认证金',
    ]
];
